#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_linux_web_app.app_backend_li: Still reading... [10s elapsed]
module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_profile_async_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_profile_async_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.function_lollipop.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CONNECTION_STRING"                                                                    = (sensitive value)
            # (31 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02"
        name                                           = "io-p-itn-auth-lollipop-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_lollipop.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CONNECTION_STRING"                                                                    = (sensitive value)
            # (32 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_lv.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CONNECTION_STRING"                                                                    = (sensitive value)
            # (27 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02"
        name                                           = "io-p-itn-auth-lv-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_lv.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CONNECTION_STRING"                                                                    = (sensitive value)
            # (27 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_profile.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CONNECTION_STRING"                                                                    = (sensitive value)
            # (44 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profile-func-02"
        name                                           = "io-p-itn-auth-profile-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_profile.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CONNECTION_STRING"                                                                    = (sensitive value)
            # (45 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profile-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_profile_async.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CONNECTION_STRING"                                                                    = (sensitive value)
            # (41 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02"
        name                                           = "io-p-itn-auth-profas-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_profile_async.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CONNECTION_STRING"                                                                    = (sensitive value)
            # (42 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_profile_autoscale.data.azurerm_linux_function_app.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_linux_function_app" "this" {
      + app_settings                                   = (known after apply)
      + auth_settings                                  = (known after apply)
      + auth_settings_v2                               = (known after apply)
      + availability                                   = (known after apply)
      + backup                                         = (known after apply)
      + builtin_logging_enabled                        = (known after apply)
      + client_certificate_enabled                     = (known after apply)
      + client_certificate_exclusion_paths             = (known after apply)
      + client_certificate_mode                        = (known after apply)
      + connection_string                              = (known after apply)
      + content_share_force_disabled                   = (known after apply)
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = (known after apply)
      + default_hostname                               = (known after apply)
      + enabled                                        = (known after apply)
      + ftp_publish_basic_authentication_enabled       = (known after apply)
      + functions_extension_version                    = (known after apply)
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = (known after apply)
      + id                                             = (known after apply)
      + identity                                       = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = (known after apply)
      + name                                           = "io-p-itn-auth-profile-func-02"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = (known after apply)
      + resource_group_name                            = "io-p-itn-auth-main-rg-01"
      + service_plan_id                                = (known after apply)
      + site_config                                    = (known after apply)
      + site_credential                                = (sensitive value)
      + sticky_settings                                = (known after apply)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = (known after apply)
      + storage_key_vault_secret_id                    = (known after apply)
      + storage_uses_managed_identity                  = (known after apply)
      + tags                                           = (known after apply)
      + usage                                          = (known after apply)
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = (known after apply)
    }

  # module.function_profile_autoscale.azurerm_monitor_autoscale_setting.this must be replaced
-/+ resource "azurerm_monitor_autoscale_setting" "this" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-auth-profile-as-02" -> (known after apply)
      ~ location            = "italynorth" -> (known after apply) # forces replacement
        name                = "io-p-itn-auth-profile-as-02"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      ~ target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-profile-asp-02" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

      ~ profile {
            name = "evening"

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profile-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profile-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-profile-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-profile-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
      ~ profile {
            name = jsonencode(
                {
                    for  = "evening"
                    name = "default"
                }
            )

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profile-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profile-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-profile-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-auth-profile-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.function_public.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CONNECTION_STRING"                                                                    = (sensitive value)
            # (27 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-public-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-public-func-02"
        name                                           = "io-p-itn-auth-public-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_public.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CONNECTION_STRING"                                                                    = (sensitive value)
            # (28 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-public-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-public-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_web_profile.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CONNECTION_STRING"                                                                    = (sensitive value)
            # (41 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01"
        name                                           = "io-p-itn-auth-webprof-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_web_profile.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_CONNECTION_STRING"                                                                    = (sensitive value)
            # (42 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.io_auth_external_apim_api_itn.azurerm_api_management_api_operation_policy.get_profile_external will be created
  + resource "azurerm_api_management_api_operation_policy" "get_profile_external" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-profile-external-api"
      + id                  = (known after apply)
      + operation_id        = "getProfile"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <rate-limit-by-key calls="250" renewal-period="5" counter-key="@(context.User.Id)"
                        retry-after-header-name="x-rate-limit-retry-after"
                        remaining-calls-header-name="x-rate-limit-remaining" />
                    <choose>
                        <when condition="@(!context.User.Groups.Select(g => g.Name).Contains("{{api-profile-external-read-group-name}}"))">
                            <return-response>
                                <set-status code="403" reason="Unauthorized, the subscription used doesn't have the required permission" />
                            </return-response>
                        </when>
                    </choose>
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.io_auth_external_apim_api_itn.azurerm_api_management_group.api_profile_external_read will be created
  + resource "azurerm_api_management_group" "api_profile_external_read" {
      + api_management_name = "io-p-itn-apim-01"
      + id                  = (known after apply)
      + name                = "apiprofileexternalread"
      + resource_group_name = "io-p-itn-common-rg-01"
      + type                = "custom"
    }

  # module.io_auth_external_apim_api_itn.azurerm_api_management_group_user.auth_n_identity_external_group will be created
  + resource "azurerm_api_management_group_user" "auth_n_identity_external_group" {
      + api_management_name = "io-p-itn-apim-01"
      + group_name          = "apiprofileexternalread"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + user_id             = "authnidentitywalletexternaluser"
    }

  # module.io_auth_external_apim_api_itn.azurerm_api_management_named_value.api_profile_external_read_group_name will be created
  + resource "azurerm_api_management_named_value" "api_profile_external_read_group_name" {
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "api-profile-external-read-group-name"
      + id                  = (known after apply)
      + name                = "api-profile-external-read-group-name"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.io_auth_external_apim_api_itn.azurerm_api_management_subscription.auth_n_identity_external will be created
  + resource "azurerm_api_management_subscription" "auth_n_identity_external" {
      + allow_tracing       = false
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "Auth & Identity External API"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
      + user_id             = (known after apply)
    }

  # module.io_auth_external_apim_api_itn.azurerm_api_management_user.auth_n_identity_wallet_external_user will be created
  + resource "azurerm_api_management_user" "auth_n_identity_wallet_external_user" {
      + api_management_name = "io-p-itn-apim-01"
      + email               = "io-wallet@pagopa.it"
      + first_name          = "PagoPA Wallet"
      + id                  = (known after apply)
      + last_name           = "PagoPA Wallet"
      + resource_group_name = "io-p-itn-common-rg-01"
      + state               = "active"
      + user_id             = "authnidentitywalletexternaluser"
    }

  # module.io_auth_external_apim_api_itn.module.api_v2_profile_external.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = "http"
      + description           = "Product for IO Profile External."
      + display_name          = "IO PROFILE EXTERNAL API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-profile-external-api"
      + path                  = "auth/external/profile/api/v1"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = "https:///api/v1"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.1
                info:
                  version: 5.19.0
                  title: IO Profile Function API
                  x-logo:
                    url: https://io.italia.it/assets/img/io-logo-blue.svg
                  description: |
                    Documentation of the IO Profile Function API here.
                servers:
                  - url: https://api.io.pagopa.it/auth/external/profile/api/v1
                security:
                  - ApiKeyAuth: []
                paths:
                  /profiles/{fiscal_code}:
                    get:
                      operationId: getProfile
                      summary: GetProfile
                      description: Retrieve a user profile
                      tags:
                        - restricted
                      parameters:
                        - $ref: "#/components/parameters/FiscalCode"
                      responses:
                        "200":
                          description: Profile created
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ExtendedProfile"
                        "400":
                          description: Invalid request.
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                        "401":
                          description: Unauthorized
                        "403":
                          description: Forbidden
                        "404":
                          description: No message found.
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                        "429":
                          description: Too many requests
                        "500":
                          description: Server Error
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                components:
                  securitySchemes:
                    ApiKeyAuth:
                      type: apiKey
                      in: header
                      name: Ocp-Apim-Subscription-Key
                  parameters:
                    FiscalCode:
                      name: fiscal_code
                      in: path
                      required: true
                      description: The fiscal code of the user, all upper case.
                      schema:
                        type: string
                        maxLength: 16
                        minLength: 16
                        pattern: >-
                          [A-Z]{6}[0-9LMNPQRSTUV]{2}[ABCDEHLMPRST][0-9LMNPQRSTUV]{2}[A-Z][0-9LMNPQRSTUV]{3}[A-Z]
                        x-example: SPNDNL80R13C555X
                  schemas:
                    ExtendedProfile:
                      description: |-
                        Describes the citizen's profile, mostly interesting for preferences
                        attributes.
                      type: object
                      properties:
                        email:
                          $ref: "#/components/schemas/EmailAddress"
                        service_preferences_settings:
                          $ref: "#/components/schemas/ServicePreferencesSettings"
                        blocked_inbox_or_channels:
                          $ref: "#/components/schemas/BlockedInboxOrChannels"
                        preferred_languages:
                          $ref: "#/components/schemas/PreferredLanguages"
                        is_inbox_enabled:
                          $ref: "#/components/schemas/IsInboxEnabled"
                        accepted_tos_version:
                          $ref: "#/components/schemas/AcceptedTosVersion"
                        is_webhook_enabled:
                          $ref: "#/components/schemas/IsWebhookEnabled"
                        is_email_enabled:
                          $ref: "#/components/schemas/IsEmailEnabled"
                        is_email_validated:
                          $ref: "#/components/schemas/IsEmailValidated"
                        is_email_already_taken:
                          type: boolean
                          default: false
                          description: |-
                            True if the user email has been validated by another user.
                            If so, the user must provide a new email.
                        reminder_status:
                          $ref: "#/components/schemas/ReminderStatus"
                        is_test_profile:
                          $ref: "#/components/schemas/IsTestProfile"
                        last_app_version:
                          $ref: "#/components/schemas/AppVersion"
                        push_notifications_content_type:
                          $ref: "#/components/schemas/PushNotificationsContentType"
                        version:
                          type: integer
                      required:
                        - is_email_enabled
                        - is_email_validated
                        - is_email_already_taken
                        - is_inbox_enabled
                        - is_webhook_enabled
                        - service_preferences_settings
                        - version
                    EmailAddress:
                      type: string
                      format: email
                      example: foobar@example.com
                    ServicePreferencesSettings:
                      description: |-
                        Describes the citizen's profile, mostly interesting for preferences
                        attributes.
                      type: object
                      properties:
                        mode:
                          $ref: "#/components/schemas/ServicesPreferencesMode"
                      required:
                        - mode
                    ServicesPreferencesMode:
                      type: string
                      enum:
                        - LEGACY
                        - AUTO
                        - MANUAL
                    BlockedInboxOrChannel:
                      type: string
                      description: |-
                        All notification channels plus the message inbox.
                        These represent all the possible channels a user could block.
                      x-extensible-enum:
                        - EMAIL
                        - INBOX
                        - WEBHOOK
                      example: INBOX
                    BlockedInboxOrChannels:
                      type: object
                      additionalProperties:
                        type: array
                        items:
                          $ref: "#/components/schemas/BlockedInboxOrChannel"
                      description: |-
                        All the notification channels blocked by the user.
                        Each channel is related to a specific service (sender).
                    PreferredLanguages:
                      type: array
                      items:
                        $ref: "#/components/schemas/PreferredLanguage"
                      description: >-
                        Indicates the User's preferred written or spoken languages in order
                
                        of preference. Generally used for selecting a localized User interface.
                        Valid
                
                        values are concatenation of the ISO 639-1 two letter language code, an
                        underscore,
                
                        and the ISO 3166-1 2 letter country code; e.g., 'en_US' specifies the
                        language
                
                        English and country US.
                    PreferredLanguage:
                      type: string
                      x-extensible-enum:
                        - it_IT
                        - en_GB
                        - es_ES
                        - de_DE
                        - fr_FR
                      example: it_IT
                    IsInboxEnabled:
                      type: boolean
                      description: |-
                        True if the recipient of a message wants to store its content for
                        later retrieval.
                    AcceptedTosVersion:
                      type: number
                      minimum: 1
                      description: Version of latest terms of service accepted by the user.
                    IsWebhookEnabled:
                      type: boolean
                      description: >-
                        True if the recipient of a message wants to forward the notifications to
                        the default webhook.
                    IsEmailValidated:
                      type: boolean
                      description: True if the user email has been validated.
                    IsEmailEnabled:
                      type: boolean
                      description: >-
                        True if the recipient of a message wants to forward the notifications to
                        his email address.
                    ReminderStatus:
                      type: string
                      x-extensible-enum:
                        - ENABLED
                        - DISABLED
                      example: ENABLED
                      description: Api definition of reminder opt-in status
                    IsTestProfile:
                      type: boolean
                      description: True if the user's profile is only for test purpose.
                      default: false
                    AppVersion:
                      type: string
                      pattern: ^((0|[1-9]\\d*)\\.){2}(0|[1-9]\\d*)(\\.(0|[1-9]\\d*)){0,1}$
                      description: A string field in Semantic Versioning format
                      example: 1.10.11
                    PushNotificationsContentType:
                      type: string
                      x-extensible-enum:
                        - FULL
                        - ANONYMOUS
                      example: FULL
                      description: >-
                        This parameter specifies how a specific user wants to visualize push
                        notifications.
                
                        FULL leads to descriptive push notifications while ANONYMOUS leads to
                        silent ones.
                    FiscalCode:
                      description: The fiscal code of the user, all upper case.
                      type: string
                      maxLength: 16
                      minLength: 16
                      pattern: >-
                        [A-Z]{6}[0-9LMNPQRSTUV]{2}[ABCDEHLMPRST][0-9LMNPQRSTUV]{2}[A-Z][0-9LMNPQRSTUV]{3}[A-Z]
                      x-example: SPNDNL80R13C555X
                    ProblemJson:
                      type: object
                      properties:
                        type:
                          type: string
                          format: uri
                          description: |-
                            An absolute URI that identifies the problem type. When dereferenced,
                            it SHOULD provide human-readable documentation for the problem type
                            (e.g., using HTML).
                          default: about:blank
                          example: https://example.com/problem/constraint-violation
                        title:
                          type: string
                          description: |-
                            A short, summary of the problem type. Written in english and readable
                            for engineers (usually not suited for non technical stakeholders and
                            not localized); example: Service Unavailable
                        status:
                          type: integer
                          format: int32
                          description: >-
                            The HTTP status code generated by the origin server for this
                            occurrence
                
                            of the problem.
                          minimum: 100
                          maximum: 600
                          exclusiveMaximum: true
                          example: 200
                        detail:
                          type: string
                          description: |-
                            A human readable explanation specific to this occurrence of the
                            problem.
                          example: There was an error processing the request
                        instance:
                          type: string
                          format: uri
                          description: >-
                            An absolute URI that identifies the specific occurrence of the
                            problem.
                
                            It may or may not yield further information if dereferenced.
            EOT
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.io_auth_external_apim_api_itn.module.api_v2_profile_external.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-profile-external-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <!--
                TODO:
                - evaluate to limit the API response to the fields that are needed
            -->
            <policies>
                <inbound>
                    <base />
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{io-fn-profile-key}}</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base />
                </outbound>
            </policies>
        EOT
    }

  # module.io_auth_external_apim_api_itn.module.api_v2_profile_external.azurerm_api_management_product_api.this["io-auth-n-identity-external-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-profile-external-api"
      + id                  = (known after apply)
      + product_id          = "io-auth-n-identity-external-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.io_auth_external_apim_api_itn.module.apim_v2_product_auth-n-identity_external.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + approval_required     = false
      + description           = "Product for IO Auth And Identity APIs."
      + display_name          = "IO AUTH AND IDENTITY EXTERNAL API"
      + id                    = (known after apply)
      + product_id            = "io-auth-n-identity-external-api"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = true
    }

  # module.io_auth_external_apim_api_itn.module.apim_v2_product_auth-n-identity_external.azurerm_api_management_product_policy.this[0] will be created
  + resource "azurerm_api_management_product_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + id                  = (known after apply)
      + product_id          = "io-auth-n-identity-external-api"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

Plan: 12 to add, 12 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
